experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run1_vclients24_workerthreads8_client3_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       94329 ops,    1224 (avg:    1347) ops/sec, 4.83MB/sec (avg: 5.31MB/sec), 19.48 (avg: 17.81) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1347.43          ---          ---     17.80700      5438.25 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1347.43         0.00         0.00     17.80700      5438.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       3.300         0.00
SET       3.600         0.00
SET       3.900         0.00
SET       4.000         0.01
SET       4.100         0.01
SET       4.200         0.01
SET       4.300         0.01
SET       4.400         0.01
SET       4.500         0.02
SET       4.600         0.02
SET       4.700         0.03
SET       4.800         0.03
SET       4.900         0.03
SET       5.000         0.04
SET       5.100         0.04
SET       5.200         0.05
SET       5.300         0.06
SET       5.400         0.06
SET       5.500         0.07
SET       5.600         0.09
SET       5.700         0.10
SET       5.800         0.11
SET       5.900         0.13
SET       6.000         0.14
SET       6.100         0.16
SET       6.200         0.19
SET       6.300         0.22
SET       6.400         0.24
SET       6.500         0.26
SET       6.600         0.29
SET       6.700         0.31
SET       6.800         0.36
SET       6.900         0.39
SET       7.000         0.42
SET       7.100         0.45
SET       7.200         0.50
SET       7.300         0.53
SET       7.400         0.58
SET       7.500         0.62
SET       7.600         0.67
SET       7.700         0.74
SET       7.800         0.80
SET       7.900         0.88
SET       8.000         0.96
SET       8.100         1.04
SET       8.200         1.13
SET       8.300         1.21
SET       8.400         1.29
SET       8.500         1.39
SET       8.600         1.49
SET       8.700         1.57
SET       8.800         1.70
SET       8.900         1.84
SET       9.000         1.97
SET       9.100         2.08
SET       9.200         2.22
SET       9.300         2.38
SET       9.400         2.53
SET       9.500         2.69
SET       9.600         2.87
SET       9.700         3.06
SET       9.800         3.26
SET       9.900         3.48
SET      10.000         4.83
SET      11.000         8.96
SET      12.000        15.56
SET      13.000        22.92
SET      14.000        30.02
SET      15.000        37.44
SET      16.000        45.37
SET      17.000        53.32
SET      18.000        61.34
SET      19.000        69.06
SET      20.000        75.81
SET      21.000        80.39
SET      22.000        83.64
SET      23.000        86.50
SET      24.000        89.08
SET      25.000        91.35
SET      26.000        93.16
SET      27.000        94.94
SET      28.000        96.24
SET      29.000        97.06
SET      30.000        97.54
SET      31.000        97.86
SET      32.000        98.13
SET      33.000        98.35
SET      34.000        98.53
SET      35.000        98.67
SET      36.000        98.80
SET      37.000        98.94
SET      38.000        99.07
SET      39.000        99.21
SET      40.000        99.31
SET      41.000        99.42
SET      42.000        99.50
SET      43.000        99.56
SET      44.000        99.61
SET      45.000        99.68
SET      46.000        99.74
SET      47.000        99.78
SET      48.000        99.82
SET      49.000        99.87
SET      50.000        99.90
SET      51.000        99.92
SET      52.000        99.92
SET      53.000        99.94
SET      54.000        99.94
SET      55.000        99.94
SET      56.000        99.96
SET      57.000        99.97
SET      58.000        99.97
SET      59.000        99.97
SET      60.000        99.97
SET      61.000        99.97
SET     200.000        99.99
SET     210.000        99.99
SET     220.000       100.00
SET     230.000       100.00
---
---