experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run1_vclients8_workerthreads32_client1_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       98863 ops,    1381 (avg:    1412) ops/sec, 5.45MB/sec (avg: 5.57MB/sec),  5.75 (avg:  5.66) msec latency

1         Threads
8         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1412.28          ---          ---      5.66100      5700.00 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1412.28         0.00         0.00      5.66100      5700.00 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.700         0.00
SET       0.730         0.00
SET       0.740         0.00
SET       0.750         0.01
SET       0.760         0.01
SET       0.770         0.02
SET       0.780         0.03
SET       0.790         0.03
SET       0.800         0.04
SET       0.810         0.06
SET       0.820         0.07
SET       0.830         0.09
SET       0.840         0.12
SET       0.850         0.15
SET       0.860         0.18
SET       0.870         0.21
SET       0.880         0.25
SET       0.890         0.29
SET       0.900         0.34
SET       0.910         0.39
SET       0.920         0.44
SET       0.930         0.51
SET       0.940         0.57
SET       0.950         0.63
SET       0.960         0.71
SET       0.970         0.81
SET       0.980         0.90
SET       0.990         1.00
SET       1.000         1.77
SET       1.100         3.70
SET       1.200         6.32
SET       1.300         9.43
SET       1.400        12.72
SET       1.500        15.91
SET       1.600        18.80
SET       1.700        21.51
SET       1.800        23.95
SET       1.900        26.09
SET       2.000        27.86
SET       2.100        29.48
SET       2.200        30.81
SET       2.300        31.94
SET       2.400        32.93
SET       2.500        33.83
SET       2.600        34.60
SET       2.700        35.25
SET       2.800        35.82
SET       2.900        36.33
SET       3.000        36.80
SET       3.100        37.23
SET       3.200        37.67
SET       3.300        38.08
SET       3.400        38.47
SET       3.500        38.84
SET       3.600        39.18
SET       3.700        39.53
SET       3.800        39.88
SET       3.900        40.23
SET       4.000        40.58
SET       4.100        40.91
SET       4.200        41.25
SET       4.300        41.61
SET       4.400        41.98
SET       4.500        42.32
SET       4.600        42.68
SET       4.700        43.03
SET       4.800        43.43
SET       4.900        43.81
SET       5.000        44.19
SET       5.100        44.61
SET       5.200        45.04
SET       5.300        45.53
SET       5.400        46.04
SET       5.500        46.57
SET       5.600        47.15
SET       5.700        47.75
SET       5.800        48.37
SET       5.900        49.05
SET       6.000        49.80
SET       6.100        50.55
SET       6.200        51.34
SET       6.300        52.26
SET       6.400        53.22
SET       6.500        54.24
SET       6.600        55.26
SET       6.700        56.30
SET       6.800        57.39
SET       6.900        58.54
SET       7.000        59.66
SET       7.100        60.90
SET       7.200        62.14
SET       7.300        63.40
SET       7.400        64.63
SET       7.500        65.93
SET       7.600        67.36
SET       7.700        68.84
SET       7.800        70.46
SET       7.900        72.13
SET       8.000        73.86
SET       8.100        75.57
SET       8.200        77.27
SET       8.300        79.00
SET       8.400        80.66
SET       8.500        82.18
SET       8.600        83.63
SET       8.700        84.84
SET       8.800        85.95
SET       8.900        86.94
SET       9.000        87.80
SET       9.100        88.53
SET       9.200        89.21
SET       9.300        89.82
SET       9.400        90.37
SET       9.500        90.86
SET       9.600        91.33
SET       9.700        91.76
SET       9.800        92.20
SET       9.900        92.60
SET      10.000        94.14
SET      11.000        95.66
SET      12.000        96.71
SET      13.000        97.53
SET      14.000        98.16
SET      15.000        98.66
SET      16.000        99.01
SET      17.000        99.28
SET      18.000        99.41
SET      19.000        99.51
SET      20.000        99.54
SET      21.000        99.58
SET      22.000        99.60
SET      23.000        99.61
SET      24.000        99.64
SET      25.000        99.65
SET      26.000        99.68
SET      27.000        99.71
SET      28.000        99.74
SET      29.000        99.79
SET      30.000        99.82
SET      31.000        99.84
SET      32.000        99.87
SET      33.000        99.89
SET      34.000        99.90
SET      35.000        99.92
SET      36.000        99.93
SET      37.000        99.94
SET      38.000        99.95
SET      39.000        99.95
SET      40.000        99.96
SET      41.000        99.96
SET      42.000        99.96
SET      43.000        99.96
SET      45.000        99.97
SET      46.000        99.97
SET      52.000        99.97
SET      58.000        99.97
SET      59.000        99.97
SET      60.000        99.97
SET      61.000        99.98
SET     130.000        99.98
SET     260.000        99.99
SET     270.000        99.99
SET     280.000       100.00
---
---