experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run2_vclients16_workerthreads32_client1_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      121894 ops,    1751 (avg:    1741) ops/sec, 6.90MB/sec (avg: 6.86MB/sec),  9.15 (avg:  9.19) msec latency

1         Threads
16        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1716.69          ---          ---      9.18500      6928.58 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1716.69         0.00         0.00      9.18500      6928.58 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.820         0.00
SET       0.970         0.00
SET       1.000         0.00
SET       1.100         0.01
SET       1.200         0.04
SET       1.300         0.09
SET       1.400         0.16
SET       1.500         0.30
SET       1.600         0.49
SET       1.700         0.75
SET       1.800         1.06
SET       1.900         1.46
SET       2.000         1.90
SET       2.100         2.39
SET       2.200         2.89
SET       2.300         3.43
SET       2.400         4.00
SET       2.500         4.57
SET       2.600         5.12
SET       2.700         5.71
SET       2.800         6.31
SET       2.900         6.88
SET       3.000         7.43
SET       3.100         8.02
SET       3.200         8.61
SET       3.300         9.18
SET       3.400         9.74
SET       3.500        10.28
SET       3.600        10.79
SET       3.700        11.34
SET       3.800        11.82
SET       3.900        12.32
SET       4.000        12.81
SET       4.100        13.30
SET       4.200        13.77
SET       4.300        14.22
SET       4.400        14.71
SET       4.500        15.21
SET       4.600        15.78
SET       4.700        16.29
SET       4.800        16.85
SET       4.900        17.37
SET       5.000        17.95
SET       5.100        18.52
SET       5.200        19.10
SET       5.300        19.63
SET       5.400        20.26
SET       5.500        20.84
SET       5.600        21.44
SET       5.700        22.07
SET       5.800        22.68
SET       5.900        23.28
SET       6.000        23.92
SET       6.100        24.54
SET       6.200        25.22
SET       6.300        25.89
SET       6.400        26.61
SET       6.500        27.32
SET       6.600        28.04
SET       6.700        28.72
SET       6.800        29.48
SET       6.900        30.24
SET       7.000        30.96
SET       7.100        31.76
SET       7.200        32.55
SET       7.300        33.32
SET       7.400        34.03
SET       7.500        34.87
SET       7.600        35.71
SET       7.700        36.64
SET       7.800        37.62
SET       7.900        38.61
SET       8.000        39.64
SET       8.100        40.74
SET       8.200        41.81
SET       8.300        42.93
SET       8.400        44.10
SET       8.500        45.33
SET       8.600        46.56
SET       8.700        47.76
SET       8.800        49.04
SET       8.900        50.27
SET       9.000        51.53
SET       9.100        52.81
SET       9.200        53.98
SET       9.300        55.13
SET       9.400        56.31
SET       9.500        57.42
SET       9.600        58.65
SET       9.700        59.79
SET       9.800        61.03
SET       9.900        62.37
SET      10.000        67.90
SET      11.000        75.51
SET      12.000        81.48
SET      13.000        86.54
SET      14.000        90.60
SET      15.000        93.61
SET      16.000        95.57
SET      17.000        96.88
SET      18.000        97.64
SET      19.000        98.10
SET      20.000        98.44
SET      21.000        98.64
SET      22.000        98.82
SET      23.000        98.99
SET      24.000        99.11
SET      25.000        99.19
SET      26.000        99.25
SET      27.000        99.31
SET      28.000        99.37
SET      29.000        99.43
SET      30.000        99.48
SET      31.000        99.52
SET      32.000        99.56
SET      33.000        99.58
SET      34.000        99.64
SET      35.000        99.69
SET      36.000        99.72
SET      37.000        99.76
SET      38.000        99.80
SET      39.000        99.83
SET      40.000        99.85
SET      41.000        99.87
SET      42.000        99.88
SET      43.000        99.89
SET      44.000        99.90
SET      45.000        99.91
SET      46.000        99.91
SET      47.000        99.93
SET      48.000        99.93
SET      49.000        99.94
SET      50.000        99.94
SET      52.000        99.95
SET      53.000        99.95
SET      54.000        99.96
SET      55.000        99.96
SET      56.000        99.96
SET      57.000        99.96
SET      58.000        99.96
SET      59.000        99.97
SET      60.000        99.97
SET      62.000        99.97
SET      63.000        99.97
SET      64.000        99.97
SET      65.000        99.98
SET      66.000        99.98
SET      72.000        99.98
SET      74.000        99.98
SET      75.000        99.98
SET      76.000        99.98
SET      84.000        99.99
SET     140.000        99.99
SET     150.000       100.00
---
---